{
    "start": {
        "he": "**\nהיי {}**.\n\nרוצים להוסיף אפשרות לתגובות בערוץ שלכם, ללא שתצטרכו לתחזק קבוצת דיון?\nפשוט פתחו קבוצת דיון, הוסיפו את הרובוט לקבוצה (עם ניהול), ואנשים לא יוכלו להצטרף, אולם עדיין יוכלו להגיב.\n\n**שלחו /help לעוד פרטים ועזרה.**\n\nרובוט ישראלי מבית [רובוטריק](t.me/RobotTrick) 😎🇮🇱\nהרובוט נוצר ע\"י [מקליד תמיד](t.me/m100achuz).\n",
        "en": "**hi {}!**\n\nDo you Want to add comments on posts on your channel But without maintaining a discussion group with users who join and talk about things that have nothing to do with the channel? \nJust add this bot to your discussion group (with Administrative Privileges) And so users Will be able to respond to posts but not join a group.\n\n**Send /help for more details**.\n\nIsraeli Bot from [RobotTrick](t.me/RobotTrick) 😎🇮🇱\n\nThis bot was created by ['Allways Typing' ](t.me/m100achuz)."
    },
    "help": {
        "he": "\n**Group Cleaner Bot**\n\nהיי, רובוט זה יוכל לעזור לכם במקרה די נפוץ, נניח ויש לכם ערוץ והנכם מעוניינים לאפשר לאנשים להגיב על הודעות בו, אולם כרגע טלגרם מאפשרת תגובות בערוצים רק אם מקושרת אליהם קבוצת דיון. סיכויים גבוהים שלא תרצו לפתוח קבוצה במיוחד בשביל תגובות, נכון? מה עושים?\n\nדבר ראשון תפתחו קבוצת דיון, בכל אופן. הקבוצה לא חייבת להיות ציבורית או משהו מיוחד.. תקראו לה איך שאתם רוצים, אתם ממש לא צריכים להשקיע בזה מחשבה.\nעכשיו תוסיפו את הרובוט לקבוצה. תוכלו ללחוץ [כאן](t.me/GroupCleanerHebBot?startgroup=start) ולבחור קבוצה.\nהוספתם לקבוצה? מעולה. **עכשיו תנו לרובוט ניהול, לפחות מחיקת הודעות והסרת משתמשים.**\n\nמרגע זה והלאה, כל משתמש שיצטרף לקבוצה - יוסר מהקבוצה אוטומטית על ידי הרובוט, ומיד לאחר מכן מוצא מהרשימה השחורה, כדי שיוכל להגיב בערוץ.\n\n[חשוב! שימו לב שלא קיים בקבוצה רובוט שמוחק הודעות הצטרפות. אם יש - תאלצו להסיר אותו.]\n\nמה קורה אם יש לכם משתמש שאתם מעוניינים שיוכל להיות בקבוצה בכל אופן? פשוט הוסיפו אותו לקבוצה ישר כמנהל. הרובוט כמובן לא מסיר מנהלים מהקבוצה.\n\nפיצ'ר נוסף שקיים ברובוט הוא ניקוי הקבוצה. אם יש לכם קבוצת דיון קיימת עם משתמשים, ואתם רוצים לוותר עליה, אחרי שהוספתם את הרובוט לקבוצה, שלחו בקבוצה `/clean` והרובוט יסיר את כל המשתמשים, שוב - חוץ ממנהלים. כמובן שהוא אוטומטית יסיר אותם גם מהרשימה השחורה, **אולם הייתי ממליץ פה ושם לבדוק אם הרשימה השחורה בקבוצה ריקה.**\n\n**הרובוט לא דורש שום ניהול בערוץ וכדומה.**\nלעוד הצעות והערות ניתן לפנות אלי [בפרטי](t.me/m100achuz) ואשתדל לעזור כמיטב יכולתי.\nהסתבכתם? יש לכם שאלה כלשהיא בקשר לרובוט זה או אחר? כנסו [לקבוצת העזרה](https://t.me/robot_trick_Group) של [רובוטריק](https://t.me/RobotTrick) 😋\n",
        "en": "Hi, this bot can help you in case  you have a channel and you interested to let users respond on the posts.\nRight now Telegram allow comments In channel only when discussing group is connected to him. High chances you don't want to open a group just for comments, right? \n\nHere the steps:\n1. Open a group, The group does not have to be a public and you can name it what ever you want.\n2. Now add this bot to your new group, you can press [here](http://t.me/GroupCleanerHebBot?startgroup=start) for that and choose your group.\n3. Go to group management and Give the bot access for delete messages and remove users.\n\nFrom here on out every users Tries to join to your 'comments group' kiked automatically by the bot and removed from removed list So he can continue to comment on posts.\n\n[IMPORTANT: Please note that you have not added a bot that deletes join/leave messages, otherwise this bot will not be able to tell when a user is joining and removing him.]\n\nWhat heppend if you want to Exclude user from removing action? Just add him and give him admin privilege (even the basic). The bot dosent remove admins.\n\nAnother cool feature the bot offers is automatic removal of existing users. After you added the bot, just send /clean inside the group and the bot remove all exist users (except admins of course).\n\n* The robot does not require channel management, only in the discussion group!\n\n* for suggestions You can contact me in [private](t.me/m100achuz) And I'll try to help as much as possible.\n\n* Getting complicated, any questions about this bot or other bots? Ask The Israeli Support Group for Telegram Bots - [RobotTrick](t.me/robot_trick_Group) 😋"
    }
}